app/views/shops/ranking.html.erb

                                <td><%= shop.address %></td>
                                <% if shop.reviews.average(:tennsuu) == nil %>
---
SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 2]]

                                <% else %>
                                    <% star = shop.reviews.average(:tennsuu).ceil.to_s %>
---
SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 2]]

                                    <td><%= image_tag file, :sizw => "20*5" %></td>
                                    <td><%= shop.reviews.average(:tennsuu).round(2) %></td>
---
SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 2]]