app/views/shops/show.html.erb

SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 2]]
---
                    <div class="table">
                        <% if @shop.reviews.average(:tennsuu) == nil %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."shop_id" = ?  [["shop_id", 2]]
---
                                        <%= image_tag "raamen.jpg", class: "raamen-favo"%>
                                        <%= @shop.favorites.count %> いいね