app/views/shops/tenranking.html.erb

                                    <td><%= shop.address %></td>
                                    <% if shop.reviews.average(:tennsuu) == nil %>
---
SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 4]]

                                    <% else %>
                                        <% star = shop.reviews.average(:tennsuu).ceil.to_s %>
---
SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 4]]

                                        <td><%= image_tag file, :sizw => "10*2" %></td>
                                        <td><%= shop.reviews.average(:tennsuu).round(2) %></td>
---
SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 4]]