app/controllers/admin/raamens_controller.rb

	  def new
      @shop = Shop.find(params[:shop_id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
      shop = Shop.find(params[:shop_id])
      raamen = Raamen.new(raamen_params.merge(shop_id: shop.id))
      if raamen.save
        redirect_to admin_shop_path(shop)
      else
        @shop = Shop.find(params[:shop_id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "raamen" ("name", "price", "text", "aji", "dashi", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "aaa"], ["price", "1200"], ["text", "aaaaaaaaa"], ["aji", "aaa"], ["dashi", "aaaa"], ["created_at", "2020-09-24 08:59:46.273762"], ["updated_at", "2020-09-24 08:59:46.273762"]]
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

 	  def show
      @shop = Shop.find(params[:shop_id])
 		  @raamen = Raamen.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "raamen".* FROM "raamen" WHERE "raamen"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  	def edit
      @shop = Shop.find(params[:shop_id])
  		@raamen = Raamen.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "raamen".* FROM "raamen" WHERE "raamen"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  	def update
      shop = Shop.find(params[:shop_id])
      @raamen = Raamen.find(params[:id])
    	@raamen.update(raamen_params) ? (redirect_to admin_shop_path(shop)) : (render :edit)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "raamen".* FROM "raamen" WHERE "raamen"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "raamen" SET "aji" = ?, "updated_at" = ? WHERE "raamen"."id" = ?  [["aji", "aaaaa"], ["updated_at", "2020-09-24 07:11:00.922982"], ["id", 16]]