app/controllers/admin/reviews_controller.rb

 	  def show
      @shop = Shop.find(params[:shop_id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]