app/controllers/admin/shops_controller.rb

  def index
    @shops = Shop.all.page(params[:page]).per(20)
---
SELECT "shops".* FROM "shops"

  def create
   	 @shop = Shop.new(shop_params)
	    if @shop.save!
---
INSERT INTO "shops" ("name", "address", "phone_number", "business_hours", "number_of_seats", "access", "text", "created_at", "updated_at", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

 	def show
 		@shop = Shop.find(params[:id])
    @raamens = @shop.raamens.all.page(params[:page]).per(5)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "raamen".* FROM "raamen" WHERE "raamen"."shop_id" = ?  [["shop_id", 1]]

  def edit
  	@shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @shop = Shop.find(params[:id])
    @shop.update(shop_params) ? (redirect_to admin_shop_path(@shop)) : (render :edit)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "shops" SET "number_of_seats" = ?, "updated_at" = ? WHERE "shops"."id" = ?  [["number_of_seats", "5席11"], ["updated_at", "2020-09-25 17:02:43.943676"], ["id", 4]]

  def destroy
    @shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]