app/controllers/favorites_controller.rb

	def create
		shop = Shop.find(params[:shop_id])
	    favorite = shop.favorites.new(user_id: current_user.id)
	    favorite.save
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "shop_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["shop_id", 2], ["created_at", "2020-10-03 08:17:02.628123"], ["updated_at", "2020-10-03 08:17:02.628123"]]

	def destroy
		shop = Shop.find(params[:shop_id])
	    favorite = current_user.favorites.find_by(shop_id: shop.id)
	    favorite.destroy
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."shop_id" = ? LIMIT ?  [["user_id", 5], ["shop_id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]