app/controllers/raamens_controller.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "raamen".* FROM "raamen" WHERE "raamen"."shop_id" = ?  [["shop_id", 1]]
---
	def index
    	@shop = Shop.find(params[:shop_id])
    	raamens = @shop.raamens
    	@raamens = raamens.all