app/controllers/reviews_controller.rb

    def show
      @shop = Shop.find(params[:shop_id])
      @raamen = Raamen.find(params[:raamen_id])
      @review = Review.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "raamen".* FROM "raamen" WHERE "raamen"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

	def new
	    @shop = Shop.find(params[:shop_id])
	    @raamen = Raamen.find(params[:raamen_id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "raamen".* FROM "raamen" WHERE "raamen"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  	def index
	    shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
      shop = Shop.find(params[:shop_id])
      raamen = Raamen.find(params[:raamen_id])
      review = Review.new(review_params)
      review.shop_id = shop.id
      review.raamen_id = raamen.id
      review.user_id = current_user.id
      if review.save
        redirect_to shop_path(shop)
      else
        @shop = Shop.find(params[:shop_id])
        @raamen = Raamen.find(params[:raamen_id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "raamen".* FROM "raamen" WHERE "raamen"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_id", "shop_id", "raamen_id", "review", "topping", "tennsuu", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["shop_id", 2], ["raamen_id", 2], ["review", "aa"], ["topping", "aaa"], ["tennsuu", "2"], ["created_at", "2020-10-02 07:12:26.700977"], ["updated_at", "2020-10-02 07:12:26.700977"]]
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "raamen".* FROM "raamen" WHERE "raamen"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  	def edit
      @shop = Shop.find(params[:shop_id])
  		@raamen = Raamen.find(params[:raamen_id])
  		@review = Review.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "raamen".* FROM "raamen" WHERE "raamen"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  	def update
      shop = Shop.find(params[:shop_id])
      raamen = Raamen.find(params[:raamen_id])
      review = Review.find(params[:id])
    	if review.user_id == current_user.id
        review.update(review_params) ? (redirect_to shop_path(shop)) : (render :edit)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "raamen".* FROM "raamen" WHERE "raamen"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "tennsuu" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["tennsuu", "1"], ["updated_at", "2020-10-01 12:59:18.229053"], ["id", 2]]