app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops"
---
  	def top
  		# shop = Shop.find(params[:id])
      @shops = Shop.all

SELECT "shops".* FROM "shops" INNER JOIN "reviews" ON "reviews"."shop_id" = "shops"."id" WHERE "reviews"."created_at" BETWEEN ? AND ? GROUP BY "shops"."id" ORDER BY average(:tennsuu) desc  [["created_at", "2020-10-01 00:00:00"], ["created_at", "2020-10-31 23:59:59.999999"]]
SELECT AVG(tennsuu) AS average_tennsuu, "shops"."id" AS shops_id FROM "shops" INNER JOIN "reviews" ON "reviews"."shop_id" = "shops"."id" GROUP BY "shops"."id"
SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 2]]
SELECT "shops".* FROM "shops"
---
  	def ranking
      shop = Shop.joins(:reviews)
      average = shop.group(:id).average(:tennsuu)

SELECT "shops".* FROM "shops" WHERE (content LIKE('%{"name"=>"cc"}%'))
---
  	def search
      @shops = Shop.search(params[:search])