app/controllers/shops_controller.rb

   	def show
 		 @shop = Shop.find(params[:id])
     @reviews = @shop.reviews.page(params[:page]).per(5)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 1]]