app/controllers/users_controller.rb

	def my_page
		@reviews = current_user.reviews.page(params[:page]).per(5)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]