app/views/reviews/_index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 1]]
---
		<tbody>
			<% shop.reviews.each do |review| %>

SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 2]]
---
<% end %>
<% star = shop.reviews.average(:tennsuu).ceil.to_s %>

SELECT AVG("reviews"."tennsuu") FROM "reviews" WHERE "reviews"."shop_id" = ?  [["shop_id", 2]]
---
	<%= image_tag file, :sizw => "70*20" %>
	<%= shop.reviews.average(:tennsuu).round(2) %>